from flask import Flask, render_template, request, redirect, url_for, session

app = Flask(__name__)

pizzas = [
    {'name': 'Рустика', 'description': 'Тiсто, курка з беконом, помідорами черрі та червоною цибулею на тонкому тісті з моцарелою та базиліком.', 'price': '500', 'image': '1.png'},
    {'name': 'Літня', 'description': 'Тісто, томатний соус, сир моцарелла, куряче філе, бекон, помідори чері, червона цибуля, болгарський перець, листя базиліку.', 'price': '500', 'image': '2.png'},
    {'name': 'Делікатесна', 'description': 'Тісто, томатний соус, сир моцарелла, шинка, гриби, артишоки, оливки, зелень.', 'price': '500', 'image': '3.png'},
    {'name': 'Літня', 'description': 'Тісто, томатний соус, сир моцарелла, куряче філе, бекон, помідори чері, червона цибуля, болгарський перець, листя базиліку.', 'price': '500', 'image': '2.png'},
    {'name': 'Маргарита', 'description': 'Тісто, томатний соус, сир моцарелла, помідори чері, оливки, базилік.', 'price': '500', 'image': '4.png'},
    {'name': 'Пепероні', 'description': 'Тісто, томатний соус, сир моцарелла, пепероні.', 'price': '500', 'image': '6.png'},
    {'name': 'Щедра', 'description': 'істо, томатний соус, сир моцарелла, пепероні, гриби, помідори чері, яйця, оливки, шинка, цибуля, зелень.', 'price': '500', 'image': '7.png'},
    {'name': 'Літня', 'description': 'Тісто, томатний соус, сир моцарелла, куряче філе, бекон, помідори чері, червона цибуля, болгарський перець, листя базиліку.', 'price': '500', 'image': '2.png'},
    {'name': 'Делікатесна', 'description': 'Тісто, томатний соус, сир моцарелла, шинка, гриби, артишоки, оливки, зелень.', 'price': '500', 'image': '3.png'},
    {'name': 'Літня', 'description': 'Тісто, томатний соус, сир моцарелла, куряче філе, бекон, помідори чері, червона цибуля, болгарський перець, листя базиліку.', 'price': '500', 'image': '2.png'},
    {'name': 'Маргарита', 'description': 'Тісто, томатний соус, сир моцарелла, помідори чері, оливки, базилік.', 'price': '500', 'image': '4.png'},
    {'name': 'Пепероні', 'description': 'Тісто, томатний соус, сир моцарелла, пепероні.', 'price': '500', 'image': '6.png'},
    {'name': 'Щедра', 'description': 'істо, томатний соус, сир моцарелла, пепероні, гриби, помідори чері, яйця, оливки, шинка, цибуля, зелень.', 'price': '500', 'image': '7.png'}
]


@app.route("/")
def index():
    return render_template('index.html')


@app.route("/menu")
def test():
    return render_template('menu.html', pizzas=pizzas)


@app.route("/support")
def support():
    return render_template('support.html', pizzas=pizzas)





if __name__ == "__main__":
    app.run(debug=False)
